//----------------------------------------------------------------------
// (C) Copyright Mohayuni All rights reserved.
//----------------------------------------------------------------------
// <Module Name> Csv読込クラス
//----------------------------------------------------------------------
// <File Name>   ReadCsv.cs
//----------------------------------------------------------------------
// <Description>
//   特定のCSVファイルを読み込み内部クラスに保持する。
// <History>
//   2015.12.27 typed
//----------------------------------------------------------------------
// <Notes>
//　 
//----------------------------------------------------------------------/

//----------------------------------------------------------------------
//	＃ｄｅｆｉｎｅ定義													
//----------------------------------------------------------------------
//#define	NOP_FUNC

//----------------------------------------------------------------------
// usingディレクティブ宣言
//----------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.IO;			//	Stream
using System.Diagnostics;	//	CallStack

using Comsrc;

namespace ReadCsv
{

	class _ReadCsv 
	{
        //-----定数定義--------------------------------------------------------------------
        //      出力フラグ

        //-----プロパティの定義--------------------------------------------------------------------
        //		static	private string ipAddress = "0.0.0.0";		//	リモートデバック出力
        //		private Trace cTrace;
        //		static private Stream p_StreamErrLog = null;

        //--------------------------------------------------------------------------------
        /// <summary>
        ///		readcsv	コンストラクタ
        ///		Notes   :
        ///         指定されたファイル名のCSVを読み込み構造体に保存する。
        ///		History :			
        ///			2015.12.27 Mohayuni
        /// </summary>
        /// <param name="strFileName"></param>
        public _ReadCsv(
            string strFileName  //	対象ファイル名
                )
        {
            return;
        }

    }	//	end class	_ReadCsv
}	//	end namespace	ReadCsv


